outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c001/bench_c51_20260831-001511.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30001 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 51 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c001/bench_c51_20260831-001511.jsonl --num-prompts 204
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=204, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=51, output_file='/workspace/outputs/c001/bench_c51_20260831-001511.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30001, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=204, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=51, output_file='/workspace/outputs/c001/bench_c51_20260831-001511.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 835584
#Output tokens: 208896
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 51        
Successful requests:                     204       
Benchmark duration (s):                  74.06     
Total input tokens:                      835584    
Total input text tokens:                 835584    
Total generated tokens:                  208896    
Total generated tokens (retokenized):    207086    
Request throughput (req/s):              2.75      
Input token throughput (tok/s):          11282.70  
Output token throughput (tok/s):         2820.67   
Peak output token throughput (tok/s):    4766.00   
Peak concurrent requests:                65        
Total token throughput (tok/s):          14103.37  
Concurrency:                             48.14     
Accept length:                           3.59      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17475.71  
Median E2E Latency (ms):                 16370.16  
P90 E2E Latency (ms):                    22529.83  
P95 E2E Latency (ms):                    23660.87  
P99 E2E Latency (ms):                    31197.78  
---------------Time to First Token----------------
Mean TTFT (ms):                          2224.75   
Median TTFT (ms):                        1210.11   
P90 TTFT (ms):                           5047.60   
P95 TTFT (ms):                           5542.88   
P99 TTFT (ms):                           15754.25  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.91     
Median TPOT (ms):                        14.58     
P90 TPOT (ms):                           19.05     
P95 TPOT (ms):                           20.61     
P99 TPOT (ms):                           22.69     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           14.98     
Median ITL (ms):                         9.60      
P90 ITL (ms):                            37.58     
P95 ITL (ms):                            40.60     
P99 ITL (ms):                            75.32     
Max ITL (ms):                            4901.22   
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/204 [00:00<?, ?it/s]
  0%|          | 1/204 [00:15<51:44, 15.29s/it]
  3%|▎         | 6/204 [00:15<06:21,  1.93s/it]
  7%|▋         | 15/204 [00:16<01:59,  1.58it/s]
  9%|▉         | 19/204 [00:17<01:39,  1.86it/s]
 10%|█         | 21/204 [00:17<01:30,  2.01it/s]
 11%|█▏        | 23/204 [00:18<01:16,  2.38it/s]
 12%|█▏        | 24/204 [00:18<01:10,  2.55it/s]
 12%|█▏        | 25/204 [00:18<01:05,  2.75it/s]
 13%|█▎        | 27/204 [00:19<00:56,  3.11it/s]
 14%|█▎        | 28/204 [00:19<00:53,  3.27it/s]
 14%|█▍        | 29/204 [00:20<01:08,  2.54it/s]
 15%|█▍        | 30/204 [00:20<01:12,  2.39it/s]
 15%|█▌        | 31/204 [00:20<01:04,  2.67it/s]
 16%|█▌        | 33/204 [00:21<00:51,  3.31it/s]
 17%|█▋        | 34/204 [00:21<00:49,  3.45it/s]
 17%|█▋        | 35/204 [00:21<00:44,  3.76it/s]
 18%|█▊        | 36/204 [00:21<00:42,  3.99it/s]
 18%|█▊        | 37/204 [00:22<00:45,  3.70it/s]
 19%|█▉        | 39/204 [00:22<00:32,  5.15it/s]
 20%|█▉        | 40/204 [00:22<00:40,  4.03it/s]
 20%|██        | 41/204 [00:22<00:38,  4.22it/s]
 21%|██        | 42/204 [00:23<00:38,  4.19it/s]
 22%|██▏       | 44/204 [00:23<00:28,  5.65it/s]
 22%|██▏       | 45/204 [00:23<00:35,  4.51it/s]
 23%|██▎       | 46/204 [00:24<00:46,  3.42it/s]
 23%|██▎       | 47/204 [00:24<00:47,  3.32it/s]
 24%|██▎       | 48/204 [00:31<05:10,  1.99s/it]
 25%|██▌       | 51/204 [00:31<02:25,  1.05it/s]
 26%|██▌       | 53/204 [00:31<01:45,  1.43it/s]
 28%|██▊       | 57/204 [00:31<00:57,  2.57it/s]
 28%|██▊       | 58/204 [00:32<00:59,  2.44it/s]
 29%|██▉       | 59/204 [00:32<00:57,  2.53it/s]
 30%|██▉       | 61/204 [00:33<00:46,  3.08it/s]
 30%|███       | 62/204 [00:33<00:53,  2.66it/s]
 31%|███       | 63/204 [00:34<00:49,  2.82it/s]
 31%|███▏      | 64/204 [00:34<00:49,  2.80it/s]
 33%|███▎      | 67/204 [00:34<00:30,  4.46it/s]
 33%|███▎      | 68/204 [00:35<00:36,  3.71it/s]
 34%|███▍      | 69/204 [00:35<00:35,  3.77it/s]
 35%|███▍      | 71/204 [00:35<00:26,  4.94it/s]
 35%|███▌      | 72/204 [00:36<00:31,  4.20it/s]
 36%|███▋      | 74/204 [00:36<00:28,  4.61it/s]
 37%|███▋      | 75/204 [00:36<00:27,  4.67it/s]
 37%|███▋      | 76/204 [00:36<00:27,  4.72it/s]
 38%|███▊      | 77/204 [00:37<00:30,  4.20it/s]
 39%|███▊      | 79/204 [00:37<00:27,  4.51it/s]
 39%|███▉      | 80/204 [00:37<00:30,  4.12it/s]
 40%|████      | 82/204 [00:38<00:26,  4.58it/s]
 41%|████      | 84/204 [00:38<00:22,  5.44it/s]
 42%|████▏     | 85/204 [00:38<00:28,  4.11it/s]
 43%|████▎     | 88/204 [00:39<00:30,  3.83it/s]
 44%|████▍     | 90/204 [00:40<00:27,  4.13it/s]
 45%|████▍     | 91/204 [00:40<00:27,  4.11it/s]
 45%|████▌     | 92/204 [00:40<00:27,  4.13it/s]
 46%|████▌     | 93/204 [00:41<00:35,  3.13it/s]
 46%|████▌     | 94/204 [00:41<00:46,  2.38it/s]
 47%|████▋     | 95/204 [00:42<00:56,  1.92it/s]
 47%|████▋     | 96/204 [00:47<02:46,  1.54s/it]
 48%|████▊     | 98/204 [00:47<01:42,  1.04it/s]
 49%|████▉     | 100/204 [00:47<01:05,  1.59it/s]
 50%|█████     | 102/204 [00:48<00:48,  2.11it/s]
 50%|█████     | 103/204 [00:49<01:00,  1.67it/s]
 51%|█████     | 104/204 [00:49<00:50,  1.96it/s]
 51%|█████▏    | 105/204 [00:49<00:46,  2.15it/s]
 52%|█████▏    | 106/204 [00:50<00:43,  2.24it/s]
 53%|█████▎    | 108/204 [00:50<00:36,  2.62it/s]
 54%|█████▍    | 111/204 [00:51<00:26,  3.52it/s]
 55%|█████▌    | 113/204 [00:51<00:27,  3.32it/s]
 57%|█████▋    | 117/204 [00:52<00:20,  4.22it/s]
 58%|█████▊    | 119/204 [00:52<00:17,  4.97it/s]
 59%|█████▉    | 120/204 [00:53<00:21,  3.87it/s]
 60%|██████    | 123/204 [00:53<00:18,  4.43it/s]
 61%|██████▏   | 125/204 [00:54<00:20,  3.80it/s]
 62%|██████▏   | 127/204 [00:54<00:16,  4.60it/s]
 63%|██████▎   | 128/204 [00:55<00:17,  4.26it/s]
 63%|██████▎   | 129/204 [00:55<00:18,  4.12it/s]
 64%|██████▍   | 131/204 [00:55<00:17,  4.17it/s]
 65%|██████▍   | 132/204 [00:56<00:18,  3.92it/s]
 66%|██████▌   | 134/204 [00:56<00:17,  3.99it/s]
 66%|██████▌   | 135/204 [00:57<00:27,  2.50it/s]
 67%|██████▋   | 136/204 [00:57<00:25,  2.70it/s]
 67%|██████▋   | 137/204 [00:58<00:24,  2.74it/s]
 68%|██████▊   | 139/204 [00:58<00:22,  2.83it/s]
 69%|██████▉   | 141/204 [00:59<00:17,  3.66it/s]
 70%|██████▉   | 142/204 [00:59<00:18,  3.36it/s]
 70%|███████   | 143/204 [01:00<00:22,  2.70it/s]
 71%|███████   | 144/204 [01:03<01:03,  1.06s/it]
 72%|███████▏  | 146/204 [01:04<00:49,  1.17it/s]
 72%|███████▏  | 147/204 [01:04<00:40,  1.40it/s]
 73%|███████▎  | 148/204 [01:05<00:36,  1.53it/s]
 73%|███████▎  | 149/204 [01:05<00:30,  1.79it/s]
 74%|███████▎  | 150/204 [01:05<00:27,  1.99it/s]
 75%|███████▍  | 152/204 [01:06<00:18,  2.75it/s]
 75%|███████▌  | 153/204 [01:06<00:18,  2.74it/s]
 75%|███████▌  | 154/204 [01:06<00:17,  2.85it/s]
 76%|███████▌  | 155/204 [01:07<00:16,  3.00it/s]
 77%|███████▋  | 157/204 [01:07<00:10,  4.34it/s]
 77%|███████▋  | 158/204 [01:07<00:12,  3.75it/s]
 78%|███████▊  | 160/204 [01:07<00:08,  5.49it/s]
 80%|███████▉  | 163/204 [01:07<00:04,  8.72it/s]
 81%|████████▏ | 166/204 [01:08<00:04,  8.75it/s]
 82%|████████▏ | 168/204 [01:08<00:03, 10.33it/s]
 83%|████████▎ | 170/204 [01:08<00:03, 11.31it/s]
 84%|████████▍ | 172/204 [01:08<00:02, 12.16it/s]
 85%|████████▌ | 174/204 [01:08<00:02, 12.53it/s]
 86%|████████▋ | 176/204 [01:09<00:02,  9.81it/s]
 87%|████████▋ | 178/204 [01:09<00:02, 10.03it/s]
 88%|████████▊ | 180/204 [01:09<00:02, 10.28it/s]
 89%|████████▉ | 182/204 [01:10<00:03,  6.41it/s]
 90%|████████▉ | 183/204 [01:10<00:03,  6.68it/s]
 91%|█████████ | 186/204 [01:10<00:02,  8.74it/s]
 92%|█████████▏| 188/204 [01:10<00:02,  7.97it/s]
 93%|█████████▎| 189/204 [01:11<00:02,  5.04it/s]
 94%|█████████▎| 191/204 [01:11<00:03,  4.32it/s]
 94%|█████████▍| 192/204 [01:12<00:04,  2.92it/s]
 95%|█████████▌| 194/204 [01:12<00:02,  3.78it/s]
 97%|█████████▋| 197/204 [01:12<00:01,  5.98it/s]
 98%|█████████▊| 200/204 [01:13<00:00,  7.89it/s]
 99%|█████████▉| 202/204 [01:13<00:00,  7.04it/s]
100%|██████████| 204/204 [01:14<00:00,  5.63it/s]
100%|██████████| 204/204 [01:14<00:00,  2.76it/s]